*** tags in my .ics file

#+BEGIN_SRC sh :results verbatim
(sep=""; for i in `grep -v "^ " test.ics | sed 's/:.*$//' | sed 's/;.*$//' | words`; do echo -n "$sep$i"; sep=" "; done; echo) | fold -s
#+END_SRC

#+RESULTS:
: acknowledged action attach attendee begin calscale class created description 
: dtend dtstamp dtstart end exdate geo last-modified location method organizer 
: priority prodid rdate recurrence-id related-to rrule sequence status summary 
: transp trigger tzid tzname tzoffsetfrom tzoffsetto uid url version 
: x-apple-calendar-color x-apple-default-alarm x-apple-structured-location 
: x-apple-travel-advisory-behavior x-apple-travel-start x-wr-alarmuid 
: x-wr-calname x-wr-timezone

which ones shall we care about?
- created
- description
- dtend
- dtstamp
- dtstart
- ?exdate?
- geo
- last-modified
- location
- ?recurrence-id?
- rrule
- ?sequence?
- summary
- url
*** emacs searching

#+BEGIN_SRC emacs-lisp :results output verbatim
  (let ((trial-space-reg '(
                           "[ \t]+"
                           "[ \t]+\\|\t+"
                           "[ \t\n]+\\|\t+\\|\n+"
                           ))
        (trial-patterns '("thisis"
                          "this is"
                          "this\tis"
                          "this	is"
                          "this\nis"
                          "this
is")))
    (princ "\n")
    (dolist (re trial-space-reg)
      (dolist (pat trial-patterns)
        (let ((result (string-match re pat)))
          (princ re)
          (princ " : ")
          (princ pat)
          (princ " : ")
          (princ result)
          (princ "\n")))))

#+END_SRC

#+RESULTS:
#+begin_example
"
[ 	]+ : thisis : nil
[ 	]+ : this is : 4
[ 	]+ : this	is : 4
[ 	]+ : this	is : 4
[ 	]+ : this
is : nil
[ 	]+ : this
is : nil
[ 	]+\\|	+ : thisis : nil
[ 	]+\\|	+ : this is : 4
[ 	]+\\|	+ : this	is : 4
[ 	]+\\|	+ : this	is : 4
[ 	]+\\|	+ : this
is : nil
[ 	]+\\|	+ : this
is : nil
[ 	
]+\\|	+\\|
+ : thisis : nil
[ 	
]+\\|	+\\|
+ : this is : 4
[ 	
]+\\|	+\\|
+ : this	is : 4
[ 	
]+\\|	+\\|
+ : this	is : 4
[ 	
]+\\|	+\\|
+ : this
is : 4
[ 	
]+\\|	+\\|
+ : this
is : 4
"
#+end_example

